# SpaceFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceFilter Constructor
SpaceFilter Class See Also
---
Constructs a filter which matches only spaces.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SpaceFilter()
```

# See Also
SpaceFilter Class
Autodesk.Revit.DB.Mechanical Namespace